function Player(_name, _hp){
	this.name =  _name;
	this.hp = _hp;
	this.enemy = null;
}
Player.prototype.attack = function () {
	
	var hurtHP = parseInt(Math.random() * 30);
	var hurtSkill = this.skills[parseInt(Math.random() * this.skills.length)];

	this.enemy.hurt(hurtHP);

	return {"hurtHP":hurtHP,"hurtSkill":hurtSkill};
}
Player.prototype.hurt = function (num) {
	this.hp -= num;
}


Player.prototype.skills = [
    '发起了猛烈的进攻，打的他满地找牙，对方损失了',
    '使用了大招，对方的假发被打掉了！损失了',
    '使用了魅惑技能，对方被迷的神魂颠倒，瞬间掉了2W的粉丝，损失了',
    '查看了葵花宝典，逼格提升了51%，对方被吓破了胆，损失了',
    '炫耀了他的大块肌肉，对方损失了',
    '狠狠的鄙视了对方一下，造成了巨大伤害，对方损失了',
    '使用了情侣花式虐狗秀恩爱，一下子打中了对方的小心脏，对方损失'
];

var nameList = [
    "猩红收割者",
    "战争女神",
    "祖安狂人",
    "扭曲树精",
    "战争之王",
    "钢铁大使",
    "光辉女郎",
    "众星之子",
    "琴瑟仙女",
    "探险家",
    "末日使者",
    "荒漠屠夫",
    "酒桶",
    "虚空行者",
    "风暴之怒",
    "迅捷斥候",
    "发条魔灵",
    "德玛西亚皇子",
    "金属大师",
    "雪人骑士",
    "海洋之灾",
    "麦林炮手",
    "刀锋意志",
    "嗜血猎手",
    "赏金猎人",
    "英勇投弹手",
    "复仇焰魂",
    "暗影之拳",
    "天启者",
    "盲僧",
    "狂暴之心",
    "玛西亚之力",
    "寒冰射手",
    "蛮族之王",
    "宝石骑士",
    "邪恶小法师",
    "武器大师",
    "暗夜猎手",
    "堕落天使",
    "虚空先知",
    "时光守护者",
    "机械公敌",
    "诅咒巨魔",
    "炼金术士",
    "策士统领",
    "魔蛇之拥",
    "死亡颂唱者",
    "黑暗之女",
    "皮城女警",
    "寡妇制造者",
    "瘟疫之源",
    "审判天使",
    "虚空恐惧",
    "狂战士",
    "殇之木乃伊",
    "哨兵之殇",
    "蒸汽机器人",
    "大发明家",
    "卡牌大师",
    "熔岩巨兽",
    "沙漠死神",
    "深渊巨口",
    "无极剑圣",
    "德邦总管",
    "狂野女猎手",
    "牛头酋长",
    "披甲龙龟",
    "首领之傲",
    "暮光之眼",
    "流浪法师",
    "冰晶凤凰",
    "不祥之刃",
    "野兽之灵",
    "亡灵勇士",
    "恶魔小丑",
    "诡术妖姬",
    "永恒梦魇"
]